testing/jmeter/results/report/statistics.json
{
  "GET /public/certificates/verify/:id" : {
    "transaction" : "GET /public/certificates/verify/:id",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.556,
    "medianResTime" : 26.0,
    "minResTime" : 22.0,
    "maxResTime" : 299.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 34.0,
    "throughput" : 33.256842595364,
    "receivedKBytesPerSec" : 36.34219420333233,
    "sentKBytesPerSec" : 6.527954454754066
  },
  "GET /exams/teacher/:id" : {
    "transaction" : "GET /exams/teacher/:id",
    "sampleCount" : 1000,
    "errorCount" : 876,
    "errorPct" : 87.6,
    "meanResTime" : 3727.3489999999993,
    "medianResTime" : 4014.5,
    "minResTime" : 98.0,
    "maxResTime" : 4832.0,
    "pct1ResTime" : 4088.0,
    "pct2ResTime" : 4164.95,
    "pct3ResTime" : 4788.9400000000005,
    "throughput" : 4.571407673564921,
    "receivedKBytesPerSec" : 5.031227000105142,
    "sentKBytesPerSec" : 2.084811898002752
  },
  "Setup - Login Teacher" : {
    "transaction" : "Setup - Login Teacher",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2204.382999999999,
    "medianResTime" : 2133.0,
    "minResTime" : 123.0,
    "maxResTime" : 2986.0,
    "pct1ResTime" : 2829.9,
    "pct2ResTime" : 2849.95,
    "pct3ResTime" : 2895.0,
    "throughput" : 4.710604040756146,
    "receivedKBytesPerSec" : 8.160753484669339,
    "sentKBytesPerSec" : 2.2536376167640975
  },
  "GET /auth/profile" : {
    "transaction" : "GET /auth/profile",
    "sampleCount" : 1000,
    "errorCount" : 531,
    "errorPct" : 53.1,
    "meanResTime" : 2841.859,
    "medianResTime" : 3008.0,
    "minResTime" : 76.0,
    "maxResTime" : 3813.0,
    "pct1ResTime" : 3704.3999999999996,
    "pct2ResTime" : 3762.0,
    "pct3ResTime" : 3791.99,
    "throughput" : 4.6708673333551305,
    "receivedKBytesPerSec" : 5.907005074897358,
    "sentKBytesPerSec" : 2.0115747011812624
  },
  "GET /public/certificates/lookup" : {
    "transaction" : "GET /public/certificates/lookup",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.778000000000013,
    "medianResTime" : 26.0,
    "minResTime" : 23.0,
    "maxResTime" : 269.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 42.960000000000036,
    "throughput" : 33.252419113490504,
    "receivedKBytesPerSec" : 33.70704203105776,
    "sentKBytesPerSec" : 6.592032304725168
  },
  "GET /courses/teacher/:id" : {
    "transaction" : "GET /courses/teacher/:id",
    "sampleCount" : 1000,
    "errorCount" : 927,
    "errorPct" : 92.7,
    "meanResTime" : 4612.871999999995,
    "medianResTime" : 5013.5,
    "minResTime" : 125.0,
    "maxResTime" : 5891.0,
    "pct1ResTime" : 5097.0,
    "pct2ResTime" : 5135.95,
    "pct3ResTime" : 5791.96,
    "throughput" : 4.609463228007098,
    "receivedKBytesPerSec" : 12.617505300882712,
    "sentKBytesPerSec" : 2.11117016985872
  },
  "Setup - Login Student" : {
    "transaction" : "Setup - Login Student",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 130.66666666666666,
    "medianResTime" : 129.5,
    "minResTime" : 121.0,
    "maxResTime" : 170.0,
    "pct1ResTime" : 135.0,
    "pct2ResTime" : 151.29999999999998,
    "pct3ResTime" : 170.0,
    "throughput" : 6.027727546714889,
    "receivedKBytesPerSec" : 10.436680605786618,
    "sentKBytesPerSec" : 1.383316380349608
  },
  "GET /notifications" : {
    "transaction" : "GET /notifications",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1871.2420000000013,
    "medianResTime" : 2011.0,
    "minResTime" : 54.0,
    "maxResTime" : 2799.0,
    "pct1ResTime" : 2053.0,
    "pct2ResTime" : 2071.0,
    "pct3ResTime" : 2758.98,
    "throughput" : 4.5699244134502015,
    "receivedKBytesPerSec" : 10.78216541298407,
    "sentKBytesPerSec" : 1.9725650300244033
  },
  "GET /exams/:publicId/take" : {
    "transaction" : "GET /exams/:publicId/take",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 110.03333333333335,
    "medianResTime" : 110.0,
    "minResTime" : 98.0,
    "maxResTime" : 140.0,
    "pct1ResTime" : 117.60000000000001,
    "pct2ResTime" : 132.85,
    "pct3ResTime" : 140.0,
    "throughput" : 6.066734074823054,
    "receivedKBytesPerSec" : 8.555042972699697,
    "sentKBytesPerSec" : 2.6304979777553084
  },
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 466.69599999999997,
    "medianResTime" : 456.5,
    "minResTime" : 140.0,
    "maxResTime" : 727.0,
    "pct1ResTime" : 642.0,
    "pct2ResTime" : 678.3499999999999,
    "pct3ResTime" : 720.94,
    "throughput" : 21.345628415300546,
    "receivedKBytesPerSec" : 36.96921093216359,
    "sentKBytesPerSec" : 4.898654958589481
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8400,
    "errorCount" : 3248,
    "errorPct" : 38.666668,
    "meanResTime" : 2390.2286904761936,
    "medianResTime" : 2129.0,
    "minResTime" : 22.0,
    "maxResTime" : 5891.0,
    "pct1ResTime" : 5033.0,
    "pct2ResTime" : 5072.0,
    "pct3ResTime" : 5744.99,
    "throughput" : 31.40550867577177,
    "receivedKBytesPerSec" : 48.962066485975946,
    "sentKBytesPerSec" : 12.094896102445517
  },
  "GET Student Profile" : {
    "transaction" : "GET Student Profile",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.23333333333332,
    "medianResTime" : 83.0,
    "minResTime" : 73.0,
    "maxResTime" : 122.0,
    "pct1ResTime" : 88.80000000000001,
    "pct2ResTime" : 120.9,
    "pct3ResTime" : 122.0,
    "throughput" : 6.12619971411068,
    "receivedKBytesPerSec" : 7.777401980804574,
    "sentKBytesPerSec" : 2.6203862058403105
  },
  "GET /dashboard/teacher" : {
    "transaction" : "GET /dashboard/teacher",
    "sampleCount" : 1000,
    "errorCount" : 914,
    "errorPct" : 91.4,
    "meanResTime" : 4637.112,
    "medianResTime" : 5027.0,
    "minResTime" : 132.0,
    "maxResTime" : 5872.0,
    "pct1ResTime" : 5131.9,
    "pct2ResTime" : 5764.849999999999,
    "pct3ResTime" : 5828.99,
    "throughput" : 4.548576522977134,
    "receivedKBytesPerSec" : 5.223755850606553,
    "sentKBytesPerSec" : 2.136587214406252
  },
  "GET Student Notifications" : {
    "transaction" : "GET Student Notifications",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.233333333333334,
    "medianResTime" : 57.0,
    "minResTime" : 51.0,
    "maxResTime" : 62.0,
    "pct1ResTime" : 60.900000000000006,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 62.0,
    "throughput" : 6.163961372508732,
    "receivedKBytesPerSec" : 11.280530871173207,
    "sentKBytesPerSec" : 2.6425576587220054
  },
  "GET /exams/my-completed" : {
    "transaction" : "GET /exams/my-completed",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.366666666666674,
    "medianResTime" : 57.0,
    "minResTime" : 49.0,
    "maxResTime" : 66.0,
    "pct1ResTime" : 60.900000000000006,
    "pct2ResTime" : 63.25,
    "pct3ResTime" : 66.0,
    "throughput" : 6.143764079459349,
    "receivedKBytesPerSec" : 5.405792417571165,
    "sentKBytesPerSec" : 2.663897706328077
  }
}